Repository: nuno314/geofence_locator
Catalog: lib/l10n/app_*.arb
Languages: ms, th, vi

# appTitle
source: Employee Geofence
ms: Sistem Pengurusan Pekerja
th: ระบบติดตามพนักงาน
vi: Quản Lý Nhân Viên

source: Current Location
ms: Lokasi Semasa
th: ตำแหน่งปัจจุบัน
vi: Vị Trí Hiện Tại

source: Location not available
ms: Lokasi tidak tersedia
th: ไม่สามารถระบุตำแหน่งได้
vi: Vị trí không khả dụng

# enableLocationTracking
source: Enable location tracking to start
ms: Aktifkan penjejakan lokasi untuk bermula
th: เปิดใช้งานการติดตามตำแหน่งเพื่อเริ่มต้น
vi: Bật theo dõi vị trí để bắt đầu

# autoUpdating
source: Auto-updating every 5 meters
ms: Kemas kini automatik setiap 5 meter
th: อัปเดตอัตโนมัติทุก 5 เมตร
vi: Tự động cập nhật mỗi 5 mét

source: Status
th: สถานะ
vi: Trạng Thái

source: Active Locations
ms: Lokasi Kerja Aktif
th: สถานที่ทำงานที่ใช้งาน
vi: Địa Điểm Hoạt Động

source: Location Tracking
ms: Penjejakan Lokasi
th: การติดตามตำแหน่ง
vi: Theo Dõi Vị Trí

source: Recent Events
ms: Peristiwa Terkini
th: เหตุการณ์ล่าสุด
vi: Sự Kiện Gần Đây

# continuouslyMonitoring
source: Continuously monitoring location
ms: Memantau lokasi secara berterusan
th: ติดตามตำแหน่งอย่างต่อเนื่อง
vi: Liên tục theo dõi vị trí

source: Work Locations
ms: Lokasi Kerja
th: สถานที่ทำงาน
vi: Địa Điểm Làm Việc

# noLocationsFound
source: No locations found. Loading from backend...
ms: Tiada lokasi dijumpai. Memuat dari backend...
th: ไม่พบสถานที่ทำงาน กำลังโหลดจากเซิร์ฟเวอร์...
vi: Không tìm thấy địa điểm. Đang tải từ backend...

source: INSIDE GEOFENCE
ms: DI DALAM KAWASAN
th: อยู่ในเขตติดตาม
vi: TRONG KHU VỰC

source: OUTSIDE GEOFENCE
ms: DI LUAR KAWASAN
th: อยู่นอกเขตติดตาม
vi: NGOÀI KHU VỰC

source: Distance
ms: Jarak
th: ระยะทาง
vi: Khoảng Cách

source: Radius
ms: Jejari
th: รัศมี
vi: Bán Kính

source: Address
ms: Alamat
th: ที่อยู่
vi: Địa Chỉ

source: Description
ms: Penerangan
th: รายละเอียด
vi: Mô Tả

# recentEventsCount
source: Recent Events
ms: Peristiwa Terkini
th: เหตุการณ์ล่าสุด
vi: Sự Kiện Gần Đây

source: Geofence History
ms: Sejarah Kawasan
th: ประวัติการติดตาม
vi: Lịch Sử Khu Vực

source: All Events
ms: Semua Peristiwa
th: เหตุการณ์ทั้งหมด
vi: Tất Cả Sự Kiện

source: Today
ms: Hari Ini
th: วันนี้
vi: Hôm Nay

source: This Week
ms: Minggu Ini
th: สัปดาห์นี้
vi: Tuần Này

source: This Month
ms: Bulan Ini
th: เดือนนี้
vi: Tháng Này

source: No events found
ms: Tiada peristiwa dijumpai
th: ไม่พบเหตุการณ์
vi: Không tìm thấy sự kiện

# geofenceEventsWillAppear
source: Geofence events will appear here
ms: Peristiwa kawasan akan muncul di sini
th: เหตุการณ์การติดตามจะปรากฏที่นี่
vi: Sự kiện khu vực sẽ xuất hiện ở đây

source: Entered
ms: Masuk
th: เข้า
vi: Đã Vào

source: Exited
ms: Keluar
th: ออก
vi: Đã Ra

source: Event
ms: Peristiwa
th: เหตุการณ์
vi: Sự Kiện

source: Date
ms: Tarikh
th: วันที่
vi: Ngày

source: Location
ms: Lokasi
th: ตำแหน่ง
vi: Vị Trí

source: Notes
ms: Nota
th: หมายเหตุ
vi: Ghi Chú

source: Close
ms: Tutup
th: ปิด
vi: Đóng

source: Add custom location
ms: Tambah lokasi tersuai
th: เพิ่มสถานที่กำหนดเอง
vi: Thêm địa điểm tùy chỉnh

source: Add New Job
ms: Tambah Kerja Baru
th: เพิ่มงานใหม่
vi: Thêm Công Việc Mới

source: Job Title
ms: Tajuk Kerja
th: ชื่องาน
vi: Tên Công Việc

source: Job Location
ms: Lokasi Kerja
th: ตำแหน่งงาน
vi: Vị Trí Công Việc

source: Use Current Location
ms: Guna Lokasi Semasa
th: ใช้ตำแหน่งปัจจุบัน
vi: Sử Dụng Vị Trí Hiện Tại

# geofenceRadius
source: Geofence Radius (meters)
ms: Jejari Kawasan (meter)
th: รัศมีเขตติดตาม (เมตร)
vi: Bán Kính Khu Vực (mét)

source: Create Job
ms: Cipta Kerja
th: สร้างงาน
vi: Tạo Công Việc

# pleaseEnterJobTitle
source: Please enter a job title
ms: Sila masukkan tajuk kerja
th: กรุณาใส่ชื่องาน
vi: Vui lòng nhập tên công việc

# pleaseEnterDescription
source: Please enter a description
ms: Sila masukkan penerangan
th: กรุณาใส่รายละเอียด
vi: Vui lòng nhập mô tả

# pleaseEnterWorkerId
source: Please enter a worker ID
ms: Sila masukkan ID pekerja
th: กรุณาใส่รหัสพนักงาน
vi: Vui lòng nhập ID nhân viên

# pleaseEnterRadius
source: Please enter a radius
ms: Sila masukkan jejari
th: กรุณาใส่รัศมี
vi: Vui lòng nhập bán kính

# pleaseEnterValidRadius
source: Please enter a valid radius
ms: Sila masukkan jejari yang sah
th: กรุณาใส่รัศมีที่ถูกต้อง
vi: Vui lòng nhập bán kính hợp lệ

source: Error getting location
ms: Ralat mendapatkan lokasi
th: เกิดข้อผิดพลาดในการรับตำแหน่ง
vi: Lỗi lấy vị trí

source: LIVE
th: สด
vi: TRỰC TIẾP

source: OFF
ms: MATI
th: ปิด
vi: TẮT

source: ON
ms: HIDUP
th: เปิด
vi: BẬT

source: Loading...
ms: Memuat...
th: กำลังโหลด...
vi: Đang tải...

source: Initializing...
ms: Memulakan...
th: กำลังเริ่มต้น...
vi: Đang khởi tạo...

source: Error initializing
ms: Ralat memulakan
th: เกิดข้อผิดพลาดในการเริ่มต้น
vi: Lỗi khởi tạo

source: Error loading jobs
ms: Ralat memuat kerja
th: เกิดข้อผิดพลาดในการโหลดงาน
vi: Lỗi tải công việc

source: Error loading locations
ms: Ralat memuat lokasi
th: เกิดข้อผิดพลาดในการโหลดสถานที่
vi: Lỗi tải địa điểm

source: Error loading events
ms: Ralat memuat peristiwa
th: เกิดข้อผิดพลาดในการโหลดเหตุการณ์
vi: Lỗi tải sự kiện

source: Error fetching locations
ms: Ralat mengambil lokasi
th: เกิดข้อผิดพลาดในการดึงข้อมูลสถานที่
vi: Lỗi tải địa điểm từ backend

source: Position updated
ms: Kedudukan dikemas kini
th: อัปเดตตำแหน่งแล้ว
vi: Vị trí đã cập nhật

# enteredGeofence
source: Entered geofence for location
ms: Memasuki kawasan untuk lokasi
th: เข้าสู่เขตติดตามสำหรับสถานที่
vi: Đã vào khu vực

# exitedGeofence
source: Exited geofence for location
ms: Keluar dari kawasan untuk lokasi
th: ออกจากเขตติดตามสำหรับสถานที่
vi: Đã ra khỏi khu vực

source: Location stream error
ms: Ralat aliran lokasi
th: เกิดข้อผิดพลาดในการสตรีมตำแหน่ง
vi: Lỗi luồng vị trí

source: Error getting initial position
ms: Ralat mendapatkan kedudukan awal
th: เกิดข้อผิดพลาดในการรับตำแหน่งเริ่มต้น
vi: Lỗi lấy vị trí ban đầu

source: Error getting current location
ms: Ralat mendapatkan lokasi semasa
th: เกิดข้อผิดพลาดในการรับตำแหน่งปัจจุบัน
vi: Lỗi lấy vị trí hiện tại

source: OFFLINE
ms: LUAR TALIAN
vi: NGOẠI TUYẾN

source: Enable Location
ms: Aktifkan Lokasi
vi: Bật Vị Trí

source: Location Permission
ms: Kebenaran Lokasi
vi: Quyền Truy Cập Vị Trí

# locationPermissionMessage
source: This app needs location access to track your position and detect when you enter geofenced areas.
ms: Aplikasi memerlukan akses lokasi untuk menjejaki kedudukan anda dan mengesan apabila anda memasuki kawasan geofence.
vi: Ứng dụng cần quyền truy cập vị trí để theo dõi vị trí của bạn và phát hiện khi bạn vào khu vực geofence.

# permissionFeatures
source: Features that require location:
ms: Ciri-ciri yang memerlukan lokasi:
vi: Tính năng cần vị trí:

# realTimeTracking
source: Real-time location tracking
ms: Penjejakan lokasi masa nyata
vi: Theo dõi vị trí thời gian thực

# geofenceNotifications
source: Geofence entry/exit notifications
ms: Notifikasi masuk/keluar geofence
vi: Thông báo vào/ra geofence

# locationHistory
source: Location history and events
ms: Sejarah lokasi dan peristiwa
vi: Lịch sử vị trí và sự kiện

source: Cancel
ms: Batal
vi: Hủy

source: Enable
ms: Aktifkan
vi: Bật

# locationEnabled
source: Location access enabled!
ms: Akses lokasi diaktifkan!
vi: Đã bật quyền truy cập vị trí!

# locationError
source: Error enabling location
ms: Ralat mengaktifkan lokasi
vi: Lỗi bật vị trí

source: Location Services Disabled
ms: Perkhidmatan Lokasi Dimatikan
vi: Dịch Vụ Vị Trí Bị Tắt

# locationServicesDisabledMessage
source: Please enable location services in your device settings to use this feature.
ms: Sila aktifkan perkhidmatan lokasi dalam tetapan peranti untuk menggunakan ciri ini.
vi: Vui lòng bật dịch vụ vị trí trong cài đặt thiết bị để sử dụng tính năng này.

source: Open Settings
ms: Buka Tetapan
vi: Mở Cài Đặt

source: Permission Denied
ms: Kebenaran Ditolak
vi: Quyền Bị Từ Chối

# permissionDeniedMessage
source: Location permission was denied. You can enable it later in app settings.
ms: Kebenaran lokasi ditolak. Anda boleh mengaktifkannya kemudian dalam tetapan aplikasi.
vi: Quyền truy cập vị trí bị từ chối. Bạn có thể bật lại sau trong cài đặt ứng dụng.

source: Permission Denied Forever
ms: Kebenaran Ditolak Selamanya
vi: Quyền Bị Từ Chối Vĩnh Viễn

# permissionDeniedForeverMessage
source: Location permission was permanently denied. Please enable it in app settings to use this feature.
ms: Kebenaran lokasi ditolak secara kekal. Sila aktifkan dalam tetapan aplikasi untuk menggunakan ciri ini.
vi: Quyền truy cập vị trí bị từ chối vĩnh viễn. Vui lòng bật trong cài đặt ứng dụng để sử dụng tính năng này.

source: Notification Permission
ms: Kebenaran Notifikasi
vi: Quyền Thông Báo

# notificationPermissionMessage
source: This app needs notification permission to alert you when you enter or exit geofenced areas.
ms: Aplikasi memerlukan kebenaran notifikasi untuk memberi amaran apabila anda memasuki atau keluar dari kawasan geofence.
vi: Ứng dụng cần quyền thông báo để cảnh báo khi bạn vào hoặc ra khỏi khu vực geofence.

source: Notification features:
ms: Ciri-ciri notifikasi:
vi: Tính năng thông báo:

# geofenceEntryAlert
source: Alert when entering geofence
ms: Amaran apabila memasuki geofence
vi: Cảnh báo khi vào geofence

# geofenceExitAlert
source: Alert when exiting geofence
ms: Amaran apabila keluar dari geofence
vi: Cảnh báo khi ra khỏi geofence

# customizableAlerts
source: Customizable alert settings
ms: Tetapan amaran yang boleh disesuaikan
vi: Cài đặt cảnh báo tùy chỉnh

source: Skip
ms: Langkau
vi: Bỏ qua

# notificationEnabled
source: Notifications enabled!
ms: Notifikasi diaktifkan!
vi: Đã bật thông báo!

# notificationDenied
source: Notification permission denied
ms: Kebenaran notifikasi ditolak
vi: Quyền thông báo bị từ chối

source: Notification Permission Denied Forever
ms: Kebenaran Notifikasi Ditolak Selamanya
vi: Quyền Thông Báo Bị Từ Chối Vĩnh Viễn

# notificationPermissionDeniedForeverMessage
source: Notification permission was permanently denied. Please enable it in app settings to receive geofence alerts.
ms: Kebenaran notifikasi ditolak secara kekal. Sila aktifkan dalam tetapan aplikasi untuk menerima amaran geofence.
vi: Quyền thông báo bị từ chối vĩnh viễn. Vui lòng bật trong cài đặt ứng dụng để nhận cảnh báo geofence.

source: Notification Permission Required
ms: Kebenaran Notifikasi Diperlukan
vi: Yêu Cầu Quyền Thông Báo

# notificationPermissionRequiredMessage
source: Enable notifications to receive alerts when entering or exiting geofenced areas.
ms: Aktifkan notifikasi untuk menerima amaran apabila memasuki atau keluar dari kawasan geofence.
vi: Bật thông báo để nhận cảnh báo khi vào hoặc ra khỏi khu vực geofence.

source: Enable Notifications
ms: Aktifkan Notifikasi
vi: Bật Thông Báo
